# Pandas

# series:  
Its is similar to numpy array but it has label index and data points.

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [3]:
labels

['a', 'b', 'c']

In [4]:
my_data

[10, 20, 30]

In [5]:
arr

array([10, 20, 30])

In [6]:
d

{'a': 10, 'b': 20, 'c': 30}

In [7]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(d)      # dictionary keys are converted into label index and values converted into data points of series.

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [14]:
# using built in function in series:

pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [15]:
ser1=pd.Series([1,2,3,4],['a','b','c','d'])     #creating 2 series.

In [16]:
ser1

a    1
b    2
c    3
d    4
dtype: int64

In [17]:
ser2=pd.Series([1,2,5,4],['a','b','e','d'])

In [18]:
ser2

a    1
b    2
e    5
d    4
dtype: int64

In [19]:
ser1['a']

1

In [20]:
ser1 + ser2         # here c and e are not present in 2 series so it returns null to op.

a    2.0
b    4.0
c    NaN
d    8.0
e    NaN
dtype: float64

# Data frames:

In [21]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(101)                      # seed is used to generate same random number.

In [22]:
df=pd.DataFrame(randn(5,4),['a','b','c','d','e'],['w','x','y','z'])

In [23]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [24]:
df['w']                 #grab column from series

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [25]:
df[['w','y']]

          w         y
a  2.706850  0.907969
b  0.651118 -0.848077
c -2.018168  0.528813
d  0.188695 -0.933237
e  0.190794  2.605967

In [26]:
type(df['w'])

pandas.core.series.Series

In [27]:
type(df)

pandas.core.frame.DataFrame

In [28]:
df.w

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [29]:
df[['w','z']]   #grab multiple columns from series

          w         z
a  2.706850  0.503826
b  0.651118  0.605965
c -2.018168 -0.589001
d  0.188695  0.955057
e  0.190794  0.683509

In [30]:
df['new'] = df['w'] + df['y']       # creating new column in series

In [31]:
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.614819
b  0.651118 -0.319318 -0.848077  0.605965 -0.196959
c -2.018168  0.740122  0.528813 -0.589001 -1.489355
d  0.188695 -0.758872 -0.933237  0.955057 -0.744542
e  0.190794  1.978757  2.605967  0.683509  2.796762

In [32]:
df.drop('new',axis=1)           # drop column from series temporarily

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [33]:
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.614819
b  0.651118 -0.319318 -0.848077  0.605965 -0.196959
c -2.018168  0.740122  0.528813 -0.589001 -1.489355
d  0.188695 -0.758872 -0.933237  0.955057 -0.744542
e  0.190794  1.978757  2.605967  0.683509  2.796762

In [34]:
df.drop('new',axis=1,inplace=True)      # drop column permenently.

In [35]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [36]:
df.drop('e')          # drop rows from series.

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057

In [37]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [38]:
df.drop('e',axis=0)         # drop rows from series.

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057

In [39]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [40]:
df.shape

(5, 4)

In [41]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [42]:
df.loc['a']         # Label based index method: grab rows namewise

w    2.706850
x    0.628133
y    0.907969
z    0.503826
Name: a, dtype: float64

In [43]:
df.iloc[1]           # Integer based index method: grab rows loc i.e. indexwise.

w    0.651118
x   -0.319318
y   -0.848077
z    0.605965
Name: b, dtype: float64

In [44]:
df.loc['b','y']

-0.8480769834036315

In [45]:
df.loc['c','x']

0.7401220570561068

In [46]:
df.loc[['a','b'],['w','y']]

          w         y
a  2.706850  0.907969
b  0.651118 -0.848077

In [47]:
df.loc[['a','b','e'],['w','x','z']]

          w         x         z
a  2.706850  0.628133  0.503826
b  0.651118 -0.319318  0.605965
e  0.190794  1.978757  0.683509

# Conditional selection:

In [48]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [49]:
df > 0            # print boolean op where values>0

       w      x      y      z
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d   True  False  False   True
e   True   True   True   True

In [50]:
booldf = df > 0

In [51]:
booldf

       w      x      y      z
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d   True  False  False   True
e   True   True   True   True

In [52]:
df[booldf]      # shows values > 0 and skip values < 0.

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [53]:
df[df>0]          # shows values > 0 and skip values < 0.

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [54]:
df['w']>0   # show column values of w > 0

a     True
b     True
c    False
d     True
e     True
Name: w, dtype: bool

In [55]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [56]:
df[df['x']>0]            # show all values > 0 from 'w' table and show other column and rows associated with it.

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
c -2.018168  0.740122  0.528813 -0.589001
e  0.190794  1.978757  2.605967  0.683509

In [57]:
df[df['z'] < 0]                 # show values from col z where values < 0.

          w         x         y         z
c -2.018168  0.740122  0.528813 -0.589001

In [58]:
df[df['w']>0]            # show all values > 0 from 'w' table and show other column and rows associated with it.

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [59]:
df[df['w'] > 0]['x']                    # show x col from df=w

a    0.628133
b   -0.319318
d   -0.758872
e    1.978757
Name: x, dtype: float64

In [60]:
df[df['w'] > 0][['x','y']]              # show x,y col from df=w

          x         y
a  0.628133  0.907969
b -0.319318 -0.848077
d -0.758872 -0.933237
e  1.978757  2.605967

In [61]:
boolser=df['w']>0

In [62]:
boolser

a     True
b     True
c    False
d     True
e     True
Name: w, dtype: bool

In [63]:
result=df[boolser]

In [64]:
result             #df[df['w']>0]  # show all values > 0 from 'w' table and show other column and rows associated with it.

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [65]:
mycols=['y','x']

In [66]:
mycols

['y', 'x']

In [67]:
result[mycols]

          y         x
a  0.907969  0.628133
b -0.848077 -0.319318
d -0.933237 -0.758872
e  2.605967  1.978757

In [68]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [69]:
df[(df['w']>0) & (df['y']>0)]         #show values of w and y >0.

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
e  0.190794  1.978757  2.605967  0.683509

In [70]:
df[(df['w']>0) | (df['y']>0)]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [71]:
#reset index

In [72]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [73]:
df.reset_index()     #make temporary index change.

  index         w         x         y         z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057
4     e  0.190794  1.978757  2.605967  0.683509

In [74]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [75]:
df.reset_index(inplace=True)        #make permanent change i.e. index values.

In [76]:
df

  index         w         x         y         z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057
4     e  0.190794  1.978757  2.605967  0.683509

In [77]:
# setting Index:

In [78]:
newind='CA NY WY OR CO'.split()

In [79]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [80]:
df['State']=newind              # Add column in to data frame.

In [81]:
df

  index         w         x         y         z State
0     a  2.706850  0.628133  0.907969  0.503826    CA
1     b  0.651118 -0.319318 -0.848077  0.605965    NY
2     c -2.018168  0.740122  0.528813 -0.589001    WY
3     d  0.188695 -0.758872 -0.933237  0.955057    OR
4     e  0.190794  1.978757  2.605967  0.683509    CO

In [82]:
newrow='1 2 3 4 5'.split()

In [83]:
newrow

['1', '2', '3', '4', '5']

In [84]:
newrow = df.append({'w' : 0.2212 , 'x' : 0.2234,'y':0.7892 ,'z':0.1765} , ignore_index=True)

In [85]:
newrow

  index         w         x         y         z State
0     a  2.706850  0.628133  0.907969  0.503826    CA
1     b  0.651118 -0.319318 -0.848077  0.605965    NY
2     c -2.018168  0.740122  0.528813 -0.589001    WY
3     d  0.188695 -0.758872 -0.933237  0.955057    OR
4     e  0.190794  1.978757  2.605967  0.683509    CO
5   NaN  0.221200  0.223400  0.789200  0.176500   NaN

In [92]:
df.drop('z',axis=1,inplace=True)      # drop column permenently.

In [94]:
df.set_index('State')      # set new column as index in series.

      index         w         x         y
State
CA        a  2.706850  0.628133  0.907969
NY        b  0.651118 -0.319318 -0.848077
WY        c -2.018168  0.740122  0.528813
OR        d  0.188695 -0.758872 -0.933237
CO        e  0.190794  1.978757  2.605967

In [95]:
df.set_index('State',inplace=True)        # make permanent index i.e. state

In [96]:
df

      index         w         x         y
State
CA        a  2.706850  0.628133  0.907969
NY        b  0.651118 -0.319318 -0.848077
WY        c -2.018168  0.740122  0.528813
OR        d  0.188695 -0.758872 -0.933237
CO        e  0.190794  1.978757  2.605967

# Multiindex:

In [97]:
outside=['g1','g1','g1','g2','g2','g2']

In [98]:
inside=[1,2,3,1,2,3]

In [99]:
hier_index=list(zip(outside,inside))

In [100]:
hier_index

[('g1', 1), ('g1', 2), ('g1', 3), ('g2', 1), ('g2', 2), ('g2', 3)]

In [101]:
hier_index=pd.MultiIndex.from_tuples(hier_index)     # created miltiindex data frame

In [102]:
df=pd.DataFrame(randn(6,2),hier_index,['a','b'])

In [103]:
df

             a         b
g1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
g2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [104]:
df.loc['g1']               #select g1 from loc

          a         b
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [105]:
df.loc['g1'].loc[1]        #select g1 loc 1 from df

a    0.302665
b    1.693723
Name: 1, dtype: float64

In [106]:
df.loc['g2'].loc[2]['b']        #select g2, loc 2, b value from df

0.07295967531703869

In [107]:
# set label names:

In [108]:
df.index.names=['groups','num']

In [109]:
df

                   a         b
groups num
g1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
g2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [110]:
df.loc['g2'].loc[2]['b']

0.07295967531703869

# Crosssection:

In [ ]:
# it is udes to select values from different index from different multiindex.

In [111]:
df

                   a         b
groups num
g1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
g2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [112]:
df.xs('g1')     # grab values of g1

            a         b
num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [113]:
df.xs(1,level='num')   # show values at 1 from g1 and g2.

               a         b
groups
g1      0.302665  1.693723
g2      0.166905  0.184502

In [114]:
df.xs(3,level='num')   # show values at level 3 from g1 and g2.

               a         b
groups
g1     -0.134841  0.390528
g2      0.638787  0.329646

In [115]:
df.xs(2,level='num')   # show values at level 2 from g1 and g2.

               a         b
groups
g1     -1.706086 -1.159119
g2      0.807706  0.072960

In [116]:
df

                   a         b
groups num
g1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
g2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

# Pandas - missing data:

In [117]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(101)                      # seed is used to generate same random number.




d={'A':[1,2,np.nan],'B':[4,np.nan,np.nan],'C':[7,8,9]}       #np.nan used to fill null values

In [118]:
#drop na method:

In [119]:
df = pd.DataFrame(d)

In [120]:
df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [121]:
df.dropna()         #dropna method

     A    B  C
0  1.0  4.0  7

In [122]:
df.dropna(axis=1)    # drop column contains value = 1

   C
0  7
1  8
2  9

In [123]:
df.dropna(thresh=2)     # drop rows which not have more than 2 interger values.

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8

In [124]:
# fill na method:

In [125]:
df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [126]:
df.fillna(value='abc')

     A    B  C
0    1    4  7
1    2  abc  8
2  abc  abc  9

In [127]:
df.fillna(value='555')

     A    B  C
0    1    4  7
1    2  555  8
2  555  555  9

In [128]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Group By:

In [129]:
import pandas as pd
import numpy as np

In [130]:
data = {'company':['g','g','f','f','a','a'],
       'Person':['a','b','c','d','e','f'],
       'Sales':[222,111,333,565,786,900]}

In [131]:
df=pd.DataFrame(data)

In [132]:
df

  company Person  Sales
0       g      a    222
1       g      b    111
2       f      c    333
3       f      d    565
4       a      e    786
5       a      f    900

In [133]:
df.groupby('company')

In [134]:
bcp=df.groupby('company')

In [135]:
bcp.mean()

         Sales
company
a        843.0
f        449.0
g        166.5

In [136]:
bcp.sum()

         Sales
company
a         1686
f          898
g          333

In [137]:
bcp.std()

              Sales
company
a         80.610173
f        164.048773
g         78.488853

In [138]:
bcp.var()

           Sales
company
a         6498.0
f        26912.0
g         6160.5

In [139]:
bcp.sum().loc['g']       # find sum of specific element in dataframe.

Sales    333
Name: g, dtype: int64

In [140]:
df.groupby('company').sum().loc['g'] # find sum of specific element in dataframe.

Sales    333
Name: g, dtype: int64

In [141]:
df.groupby('company').sum()

         Sales
company
a         1686
f          898
g          333

In [142]:
df.groupby('company').count()

         Person  Sales
company
a             2      2
f             2      2
g             2      2

In [143]:
df.groupby('company').max()

        Person  Sales
company
a            f    900
f            d    565
g            b    222

In [144]:
df.groupby('company').min()

        Person  Sales
company
a            e    786
f            c    333
g            a    111

In [145]:
df

  company Person  Sales
0       g      a    222
1       g      b    111
2       f      c    333
3       f      d    565
4       a      e    786
5       a      f    900

In [146]:
df.groupby('company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
company
a         2.0  843.0   80.610173  786.0  814.50  843.0  871.50  900.0
f         2.0  449.0  164.048773  333.0  391.00  449.0  507.00  565.0
g         2.0  166.5   78.488853  111.0  138.75  166.5  194.25  222.0

In [147]:
df.groupby('company').describe().transpose()   # used to show data for each company

company               a           f           g
Sales count    2.000000    2.000000    2.000000
      mean   843.000000  449.000000  166.500000
      std     80.610173  164.048773   78.488853
      min    786.000000  333.000000  111.000000
      25%    814.500000  391.000000  138.750000
      50%    843.000000  449.000000  166.500000
      75%    871.500000  507.000000  194.250000
      max    900.000000  565.000000  222.000000

In [148]:
df.groupby('company').describe().transpose()['a']   # used to show data for each company

Sales  count      2.000000
       mean     843.000000
       std       80.610173
       min      786.000000
       25%      814.500000
       50%      843.000000
       75%      871.500000
       max      900.000000
Name: a, dtype: float64

# merging Joining and concatenating:

In [149]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [150]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [151]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [152]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [153]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [154]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [155]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [156]:
pd.concat([df1,df2,df3],axis=1)         # concat based on axis

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [157]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [158]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [159]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [160]:
pd.concat([left,right])

/Users/pratiknarendrapawar/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     A    B    C    D key
0   A0   B0  NaN  NaN  K0
1   A1   B1  NaN  NaN  K1
2   A2   B2  NaN  NaN  K2
3   A3   B3  NaN  NaN  K3
0  NaN  NaN   C0   D0  K0
1  NaN  NaN   C1   D1  K1
2  NaN  NaN   C2   D2  K2
3  NaN  NaN   C3   D3  K3

# Merging:

In [161]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [162]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [163]:
pd.merge(left,right,on=['key'])

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [164]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [165]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']},
                    index=['a', 'b', 'c','d'])
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']},
                    index=['p', 'q', 'r','s'])

In [166]:
left

  key1 key2   A   B
a   K0   K0  A0  B0
b   K0   K1  A1  B1
c   K1   K0  A2  B2
d   K2   K1  A3  B3

In [167]:
right

  key1 key2   C   D
p   K0   K0  C0  D0
q   K1   K0  C1  D1
r   K1   K0  C2  D2
s   K2   K0  C3  D3

In [168]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [169]:
left

  key1 key2   A   B
a   K0   K0  A0  B0
b   K0   K1  A1  B1
c   K1   K0  A2  B2
d   K2   K1  A3  B3

In [170]:
right

  key1 key2   C   D
p   K0   K0  C0  D0
q   K1   K0  C1  D1
r   K1   K0  C2  D2
s   K2   K0  C3  D3

In [171]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [172]:
right

  key1 key2   C   D
p   K0   K0  C0  D0
q   K1   K0  C1  D1
r   K1   K0  C2  D2
s   K2   K0  C3  D3

In [173]:
left

  key1 key2   A   B
a   K0   K0  A0  B0
b   K0   K1  A1  B1
c   K1   K0  A2  B2
d   K2   K1  A3  B3

In [174]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [175]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [177]:
# left.join(right)

In [178]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [179]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [180]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [181]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [182]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [183]:
right.join(left,how='right')

      C    D   A   B
K0   C0   D0  A0  B0
K1  NaN  NaN  A1  B1
K2   C2   D2  A2  B2

In [184]:
left.join(right,how='inner')

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

 # OPERATIONS : (UNIQUE,VALUE_COUNT)

In [185]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [186]:
df['col2'].unique()           # to find unique values

array([444, 555, 666])

In [187]:
len(df['col2'].unique())

3

In [188]:
(df['col2'].nunique()) #count unique values

3

In [189]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [190]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [191]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [192]:
[df['col1']>2]

[0    False
 1    False
 2     True
 3     True
 Name: col1, dtype: bool]

In [193]:
df[(df['col1']>2) & (df['col2']==666)]

   col1  col2 col3
2     3   666  ghi

# Apply:

In [194]:
def time2(x):
    return x*2

In [195]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [196]:
df['col1'].apply(time2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [197]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [198]:
df['col3'].apply(lambda x : x*2)

0    abcabc
1    defdef
2    ghighi
3    xyzxyz
Name: col3, dtype: object

In [199]:
df['col2'].apply(lambda x : x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [200]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [201]:
df['col1'].apply(time2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [202]:
df['col2'].apply(lambda y : y + 2)

0    446
1    557
2    668
3    446
Name: col2, dtype: int64

In [203]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [204]:
df.drop('col1',axis=1)    # drop column

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [205]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [206]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [207]:
df.index

RangeIndex(start=0, stop=4, step=1)

# sorting:

In [208]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [209]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [210]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [211]:
df.isnull()  # to find null values

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [212]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [213]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [214]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [215]:
pwd

'/Users/pratiknarendrapawar/Desktop/python/python code'

 # input and output:

In [216]:


import pandas as pd

In [217]:
pd.read_csv('alarms.csv')

,Timestamp,Requestor,Role,Component Accessed,Request type,Violation type,Alarm
0,8/10/16 6:15,User B,Business user,Table 2,Select,No authorization,False
1,8/10/16 6:29,User B,Business user,Table 2,Select,No authorization,False
2,8/10/16 6:43,User B,Business user,Table 2,Select,No authorization,False
3,8/10/16 6:58,User C,Administrator,Element 1,Select,No authorization,False
4,8/10/16 7:12,User A,Analyst,Element 2,Select,No authorization,True
...,...,...,...,...,...,...,...
1188,8/21/16 9:22,User A,Analyst,Table 1,Select,No authorization,False
1189,8/21/16 9:36,User A,Analyst,Table 1,Select,No authorization,False
1190,8/21/16 9:51,User B,Business user,Table 1,Select,No authorization,True
1191,8/21/16 10:05,User B,Business user,Table 1,Select,No authorization,True
1192,8/21/16 10:19,User B,Business user,Table 1,Select,No authorization,True

In [218]:
df=pd.read_csv('alarms.csv')

In [219]:
df

,Timestamp,Requestor,Role,Component Accessed,Request type,Violation type,Alarm
0,8/10/16 6:15,User B,Business user,Table 2,Select,No authorization,False
1,8/10/16 6:29,User B,Business user,Table 2,Select,No authorization,False
2,8/10/16 6:43,User B,Business user,Table 2,Select,No authorization,False
3,8/10/16 6:58,User C,Administrator,Element 1,Select,No authorization,False
4,8/10/16 7:12,User A,Analyst,Element 2,Select,No authorization,True
...,...,...,...,...,...,...,...
1188,8/21/16 9:22,User A,Analyst,Table 1,Select,No authorization,False
1189,8/21/16 9:36,User A,Analyst,Table 1,Select,No authorization,False
1190,8/21/16 9:51,User B,Business user,Table 1,Select,No authorization,True
1191,8/21/16 10:05,User B,Business user,Table 1,Select,No authorization,True
1192,8/21/16 10:19,User B,Business user,Table 1,Select,No authorization,True

In [220]:
df.to_csv('ABC',index=False)

In [221]:
pd.read_csv('ABC')

,Timestamp,Requestor,Role,Component Accessed,Request type,Violation type,Alarm
0,8/10/16 6:15,User B,Business user,Table 2,Select,No authorization,False
1,8/10/16 6:29,User B,Business user,Table 2,Select,No authorization,False
2,8/10/16 6:43,User B,Business user,Table 2,Select,No authorization,False
3,8/10/16 6:58,User C,Administrator,Element 1,Select,No authorization,False
4,8/10/16 7:12,User A,Analyst,Element 2,Select,No authorization,True
...,...,...,...,...,...,...,...
1188,8/21/16 9:22,User A,Analyst,Table 1,Select,No authorization,False
1189,8/21/16 9:36,User A,Analyst,Table 1,Select,No authorization,False
1190,8/21/16 9:51,User B,Business user,Table 1,Select,No authorization,True
1191,8/21/16 10:05,User B,Business user,Table 1,Select,No authorization,True
1192,8/21/16 10:19,User B,Business user,Table 1,Select,No authorization,True

 HtML

In [222]:
data=pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [223]:
data

[                             Bank Name           City  ST   CERT  \
 0                 The First State Bank  Barboursville  WV  14361
 1                   Ericson State Bank        Ericson  NE  18265
 2     City National Bank of New Jersey         Newark  NJ  21111
 3                        Resolute Bank         Maumee  OH  58317
 4                Louisa Community Bank         Louisa  KY  58112
 ..                                 ...            ...  ..    ...
 556                 Superior Bank, FSB       Hinsdale  IL  32646
 557                Malta National Bank          Malta  OH   6629
 558    First Alliance Bank & Trust Co.     Manchester  NH  34264
 559  National State Bank of Metropolis     Metropolis  IL   3815
 560                   Bank of Honolulu       Honolulu  HI  21029

                    Acquiring Institution       Closing Date
 0                         MVB Bank, Inc.      April 3, 2020
 1             Farmers and Merchants Bank  February 14, 2020
 2                        Industrial Bank   November 1, 2019
 3                     Buckeye State Bank   October 25, 2019
 4      Kentucky Farmers Bank Corporation   October 25, 2019
 ..                                   ...                ...
 556                Superior Federal, FSB      July 27, 2001
 557                    North Valley Bank        May 3, 2001
 558  Southern New Hampshire Bank & Trust   February 2, 2001
 559              Banterra Bank of Marion  December 14, 2000
 560                   Bank of the Orient   October 13, 2000

 [561 rows x 6 columns]]

In [224]:
type(data)

list

In [225]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"

# Reading SQL File:

In [226]:
from sqlalchemy import create_engine      # creating temporary database.

In [227]:
engine = create_engine('sqlite:///:memory:')

In [228]:
df.to_sql('my_table',engine)

In [229]:
sqldf = pd.read_sql('my_table',con=engine)

In [230]:
sqldf

,index,Timestamp,Requestor,Role,Component Accessed,Request type,Violation type,Alarm
0,0,8/10/16 6:15,User B,Business user,Table 2,Select,No authorization,False
1,1,8/10/16 6:29,User B,Business user,Table 2,Select,No authorization,False
2,2,8/10/16 6:43,User B,Business user,Table 2,Select,No authorization,False
3,3,8/10/16 6:58,User C,Administrator,Element 1,Select,No authorization,False
4,4,8/10/16 7:12,User A,Analyst,Element 2,Select,No authorization,True
...,...,...,...,...,...,...,...,...
1188,1188,8/21/16 9:22,User A,Analyst,Table 1,Select,No authorization,False
1189,1189,8/21/16 9:36,User A,Analyst,Table 1,Select,No authorization,False
1190,1190,8/21/16 9:51,User B,Business user,Table 1,Select,No authorization,True
1191,1191,8/21/16 10:05,User B,Business user,Table 1,Select,No authorization,True
1192,1192,8/21/16 10:19,User B,Business user,Table 1,Select,No authorization,True

In [231]:
sqldf

,index,Timestamp,Requestor,Role,Component Accessed,Request type,Violation type,Alarm
0,0,8/10/16 6:15,User B,Business user,Table 2,Select,No authorization,False
1,1,8/10/16 6:29,User B,Business user,Table 2,Select,No authorization,False
2,2,8/10/16 6:43,User B,Business user,Table 2,Select,No authorization,False
3,3,8/10/16 6:58,User C,Administrator,Element 1,Select,No authorization,False
4,4,8/10/16 7:12,User A,Analyst,Element 2,Select,No authorization,True
...,...,...,...,...,...,...,...,...
1188,1188,8/21/16 9:22,User A,Analyst,Table 1,Select,No authorization,False
1189,1189,8/21/16 9:36,User A,Analyst,Table 1,Select,No authorization,False
1190,1190,8/21/16 9:51,User B,Business user,Table 1,Select,No authorization,True
1191,1191,8/21/16 10:05,User B,Business user,Table 1,Select,No authorization,True
1192,1192,8/21/16 10:19,User B,Business user,Table 1,Select,No authorization,True

In [232]:
sqldf['Requestor'].count()

1193

In [233]:
a=sqldf.groupby('Requestor')

In [234]:
a.mean()

                index     Alarm
Requestor
User A     594.814493  0.057971
User B     598.288952  0.283286
User C     596.066667  0.000000

In [235]:
a.count()

,index,Timestamp,Role,Component Accessed,Request type,Violation type,Alarm
Requestor,,,,,,,
User A,690,690,690,690,690,690,690
User B,353,353,353,353,353,353,353
User C,150,150,150,150,150,150,150

In [236]:
a.max()

,index,Timestamp,Role,Component Accessed,Request type,Violation type,Alarm
Requestor,,,,,,,
User A,1189,8/21/16 9:36,Analyst,Table 1,Select,No authorization,True
User B,1192,8/21/16 9:51,Business user,Table 2,Select,No authorization,True
User C,1187,8/21/16 9:07,Administrator,Element 3,Select,No authorization,False

In [237]:
a[['Role','Alarm']].corr()     # correlation.

                 Alarm
Requestor
User A    Alarm    1.0
User B    Alarm    1.0
User C    Alarm    NaN

In [238]:
a['Role'].value_counts().tail(1)

Requestor  Role
User C     Administrator    150
Name: Role, dtype: int64